{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report containing an empty feature list.",
  "frontend-file-summaries.txt": "Text file listing summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base file defining extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point with SEO meta tags and script loading the React app.",
  "frontend/src/App.tsx": "Main SPA component rendering all sections with scroll‑based metadata updates.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, simulated submit delay, and success feedback.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing SEO approach, principles, and tools used.",
  "frontend/src/components/sections/CaseStudiesSection.tsx": "Renders a case studies section showing SEO project challenges, actions, and results using cards and icons.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays a contact section with location, response details, a contact form, and direct email info.",
  "frontend/src/components/sections/HomeSection.tsx": "Defines the homepage hero with intro text, CTA buttons that scroll to sections, and a list of specialties.",
  "frontend/src/components/sections/ServicesSection.tsx": "Shows a grid of SEO services with icons, descriptions, and deliverables inside styled cards.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying SEO specialist info, attribution, and current year.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with scroll‑aware navigation and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and auth client setup.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode colors, and utility classes for consistent UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider wrapping the root component.",
  "frontend/src/seo/seoConfig.ts": "Defines SEO metadata types and provides default SEO settings, section-specific metadata, base site URL, and JSON-LD structured data configuration.",
  "frontend/src/seo/SeoHeadManager.tsx": "React component that updates document head tags (title, meta, Open Graph, Twitter, canonical URL, and JSON-LD) based on provided SEO metadata and section.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Project metadata describing site purpose, SEO goals, constraints, existing features, and architectural notes for the portfolio website."
}